_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_УстановкаНормативнойБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_УстановкаНормативнойБазы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДиректорияФайловПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорияНормативнойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_УстановкаНормативнойБазы/Forms/ФормаУправляемая/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

// БАЗОВЫЕ ФУНКЦИИ

&НаКлиенте
Процедура ДоступностьЭлементов()
	
	Элементы.НадписьСсылка.Доступность = Истина;
	
	Если ЗначениеЗаполнено(Объект.Ид) Тогда
		Элементы.НадписьСсылка.Заголовок = НСтр("ru='Вы можете перейти к настройкам внешней нормативной базы'");
	Иначе
		Элементы.НадписьСсылка.Заголовок = НСтр("ru='Ключ не найден! Настройте параметры внешней нормативной базы'");
	КонецЕсли;
	
КонецПроцедуры

// ОБРАБОТКИ СОБЫТИЙ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ВерсияКомпоненты = Число(СметнаяКомпонента.Version);
	Исключение
		ВерсияКомпоненты = 1;
	КонецПопытки;
	
	Если СметнаяКомпонента = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Внешняя нормативная база не установлена'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если ВерсияКомпоненты > 1 Тогда
		ПоказатьПредупреждение(,НСтр("ru='Для данной версии нормативной базы существует отдельная программа установки в дистрибутиве'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.Ид = СметнаяКомпонента.ПолучитьИдентификаторКлюча();
	
	ДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Попытка
		// Открытие из сохраненных значений.
		// Восстанавливаем значения параметров из базы.
		ПараметрыСвойств = СМ_СметаВызовСервера.ПараметрыСвойствСметнойКомпоненты();
	
		Объект.ДиректорияНормативнойБазы = ПараметрыСвойств.ДиректорияНорм;
	Исключение
		Событие = НСтр("ru = 'Исключение Установка нормативной базы'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиректорияФайловПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;   
	Если СМ_СметаКлиент.сфВыборКаталога(Объект.ДиректорияФайловПоставки) Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиректорияНормативнойБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;   
	Если СМ_СметаКлиент.сфВыборКаталога(Объект.ДиректорияНормативнойБазы) Тогда
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяУстановка(Команда)
	
	ВыполнитьОбновлениеВнутреннихСправочников(СметнаяКомпонента.Установить(Объект.ДиректорияФайловПоставки, Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура Дополнение(Команда)
	
	ВыполнитьОбновлениеВнутреннихСправочников(СметнаяКомпонента.Установить(Объект.ДиректорияФайловПоставки, Ложь));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеВнутреннихСправочников(КодБазы = Неопределено)
	
	Если ЗначениеЗаполнено(КодБазы) Тогда
		
		ПоказатьОповещениеПользователя(НСтр("ru='Обновление необходимых внутренних справочников'"));
		
		МассивСНБ = Новый СписокЗначений();
		МассивСНБ.Добавить(КодБазы);
		
		СМ_СметаЗагрузкаКлиент.ОбновитьСНБ(МассивСНБ, СметнаяКомпонента, ВерсияКомпоненты);
		
		ПоказатьОповещениеПользователя(НСтр("ru='Установка нормативной базы завершена'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
